In [2]:
# Exercise 4.1
import pandas as pd
list = [1,2,3,4,5,6]
print(pd.Series(list))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
# Exercise 4.2
per1 = pd.date_range(start ='05-01-2021', end ='05-12-2021') 
print(per1)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [10]:
# Exercise 4.3
dict = {
  'fist_name': ['John', 'Andrew'],
  'last_name': ['Brown', 'Purple'],
  'age': [25, 48]
}
pd.DataFrame.from_dict(dict)

  fist_name last_name  age
0      John     Brown   25
1    Andrew    Purple   48

In [13]:
# Exercise 4.4
list = [['Betteena', 25], ['Anu', 30],  
       ['Aysha', 26], ['Anuja', 22]]  
  
# creating df object with columns specified     
df = pd.DataFrame(list, columns =['Name', 'Mark'])  
print(df )

       Name  Mark
0  Betteena    25
1       Anu    30
2     Aysha    26
3     Anuja    22

In [14]:
# Exercise 4.5
df = pd.read_csv('data.csv')
print(df)

       Name  Age  Mark
0  Betteena   21    30
1    Anitta   26    34
2    Josiah   22    35

In [18]:
# Exercise 4.6
df = pd.DataFrame({'Name': ['Raj', 'Sonum', 'Tilak'],
                   'Age': [20, 22, 21],
                   })
 
print('DATAFRAME')
print(df)
print('SORTED DATAFRAME')
df.sort_values(by=['Age'], ascending=False)

DATAFRAME
    Name  Age
0    Raj   20
1  Sonum   22
2  Tilak   21
SORTED DATAFRAME

    Name  Age
1  Sonum   22
2  Tilak   21
0    Raj   20

In [23]:
# Exercise 4.7

df = pd.DataFrame({
                    'Networking': [45, 34, 23],
                    'Web Engineering': [32, 43, 23],
                    'Complier Design': [14, 42, 21]
                  }, index=['Abhishek', 'Saumya', 'Ayushi']
                 )
print('Data frame with custom indexing')
print(df)
print('\nData frame with default indexing')
df.reset_index()

Data frame with custom indexing
          Networking  Web Engineering  Complier Design
Abhishek          45               32               14
Saumya            34               43               42
Ayushi            23               23               21

Data frame with default indexing

      index  Networking  Web Engineering  Complier Design
0  Abhishek          45               32               14
1    Saumya          34               43               42
2    Ayushi          23               23               21

In [30]:
# Exercise 4.8
df = pd.DataFrame({
                    'Networking': [45, 34, 23],
                    'Web Engineering': [32, 43, 23],
                    'Complier Design': [14, 42, 21]
                  }, index=['Abhishek', 'Saumya', 'Ayushi']
                 )
df.head(2)

          Networking  Web Engineering  Complier Design
Abhishek          45               32               14
Saumya            34               43               42

In [31]:
# Exercise 4.9
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Occupation': ['Engineer', 'Teacher', 'Doctor', 'Engineer', 'Doctor'],
    'Salary': [60000, 45000, 75000, 65000, 80000]
}

df = pd.DataFrame(data)
print(df.groupby('Occupation')['Salary'].mean())

Occupation
Doctor      77500.0
Engineer    62500.0
Teacher     45000.0
Name: Salary, dtype: float64

In [27]:
# Exercise 4.10
import numpy as np


data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, 2, 3, 4, np.nan]
}

df = pd.DataFrame(data)

df_filled = df.fillna(0)


print(df_filled)

     A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  2.0
2  0.0  3.0  3.0
3  4.0  0.0  4.0
4  5.0  5.0  0.0

In [34]:
# Exercise 4.11
data = {
    'cname': ['Company A', 'Company B', 'Company C', 'Company D'],
    'profit': [10000, -5000, 0, 7500]
}

df = pd.DataFrame(data)

df['profit'] = df['profit'] > 0
df.rename(columns={'profit':'is_profit'},inplace=True)

print(df)

       cname  is_profit
0  Company A       True
1  Company B      False
2  Company C      False
3  Company D       True

In [33]:
# Exercise 4.12
data1 = {
    'eid': [101, 102, 103, 104],
    'ename': ['Alice', 'Bob', 'Charlie', 'David'],
    'stipend': [5000, 6000, 5500, 7000]
}

data2 = {
    'eid': [101, 103, 104, 105],
    'designation': ['Engineer', 'Manager', 'Analyst', 'Technician']
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

result_df = df1.merge(df2, on='eid', how='left')

result_df = result_df.rename(columns={'designation': 'position'})

print(result_df)

   eid    ename  stipend  position
0  101    Alice     5000  Engineer
1  102      Bob     6000       NaN
2  103  Charlie     5500   Manager
3  104    David     7000   Analyst